#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
[0m[1moci_identity_compartment.compart_main: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa25xmh6d3rbtfrcchdafdpcv3rebwxmteckjpak2elfedp5gzp3mq][0m
[0m[1moci_core_vcn.vcn_main: Refreshing state... [id=ocid1.vcn.oc1.iad.amaaaaaa6lcny6yaxxaf7miekgedqfcv6f3vqemrxvjngfnn4ac3q2lamjyq][0m
[0m[1moci_core_dhcp_options.dhcp-options: Refreshing state... [id=ocid1.dhcpoptions.oc1.iad.aaaaaaaaxxkzesxmnc54rkmjzmpmgacgcve7to7cf32tac7n6yawmoyypnaa][0m
[0m[1moci_core_route_table.route_private: Refreshing state... [id=ocid1.routetable.oc1.iad.aaaaaaaafi63fdd4ulliqd7szoqfs7coxmq326wrjyyxsm33bj6tkilwgufq][0m
[0m[1moci_core_internet_gateway.internet_gateway: Refreshing state... [id=ocid1.internetgateway.oc1.iad.aaaaaaaaxjhycf2woscdtvt3pxwgl633i32bktclnelmi3ffdnqhbbnjbswa][0m
[0m[1moci_core_security_list.private-security-list: Refreshing state... [id=ocid1.securitylist.oc1.iad.aaaaaaaauyze5w6xqeww5nqcabbn6kwx3l7aks2jbfqxachkbqfjn3tautra][0m
[0m[1moci_core_security_list.public-security-list: Refreshing state... [id=ocid1.securitylist.oc1.iad.aaaaaaaanadvjant67ck3sirxwiylt4oxnokoengyjsi6qdphd2xqeiwe4la][0m
[0m[1moci_core_route_table.route_public: Refreshing state... [id=ocid1.routetable.oc1.iad.aaaaaaaaf5xqbaboes6dn2u42ky7do35g2ofczxwwsytvfuwsl6n3tal6bca][0m
[0m[1moci_core_subnet.vcn-private-subnet: Refreshing state... [id=ocid1.subnet.oc1.iad.aaaaaaaaz43cawfjopx7zc6pn5edwsboy5jmsystahuqizpuc6baa7qvvuhq][0m
[0m[1moci_core_subnet.vcn-public-subnet: Refreshing state... [id=ocid1.subnet.oc1.iad.aaaaaaaavykfd3t6zx5s7hrboxlod4byrxfczdxk3jvngm3fsuey3vzblzuq][0m
[0m[1moci_core_instance.CreateInstance[0]: Refreshing state... [id=ocid1.instance.oc1.iad.anuwcljt6lcny6yce3e7j3ljehrvsesc2h3wzzd6e2oharglxrmw6mjwhh5q][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # oci_core_instance.CreateInstance[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "oci_core_instance" "CreateInstance" {
      [32m+[0m [0m[1m[0mavailability_domain[0m[0m                 = "jKpz:US-ASHBURN-AD-2"
      [32m+[0m [0m[1m[0mboot_volume_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mcompartment_id[0m[0m                      = "ocid1.compartment.oc1..aaaaaaaa25xmh6d3rbtfrcchdafdpcv3rebwxmteckjpak2elfedp5gzp3mq"
      [32m+[0m [0m[1m[0mdedicated_vm_host_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mdefined_tags[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m                        = "test-instance-02"
      [32m+[0m [0m[1m[0mfault_domain[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mfreeform_tags[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mhostname_label[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mimage[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mipxe_script[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mis_pv_encryption_in_transit_enabled[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mlaunch_mode[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m                            = {
          [32m+[0m [0m"ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC7hj+XgG1wgsIqyYLYyZ3IdU3dUXO38tmdyr/d8Jtn6FFanalV6GofJdFFnzrmVyJHlwXFcc6R0QHnYH6btJo7akUdzdHy+hD8Hdr8kLMX0b3PqTfJBLo+19LWn4t7oXXpsKTFRyTP1dYoLcOfQ/ZZSuhQCzyzi9U2vpJRZjgXij5WmXv0cR7LYuZfzuNJS69iGIHBC6exMvTw2fXG0U28i4w6lSkS1lFcpdg+CZ3VXvWkimXVEi+zN3eu2iSu62WTBI9G/ed9hX5UHXCqnkhM4Og8CCJFbzP5TxrEtHVDWPuR2G50tmDHp1De3YlVL6z6Hj6IEeLz5yzJZTL/vhUp root@centos07-dev-felipe"
        }
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mshape[0m[0m                               = "VM.Standard.E2.1.Micro"
      [32m+[0m [0m[1m[0mstate[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0msystem_tags[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mtime_created[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtime_maintenance_reboot_due[0m[0m         = (known after apply)

      [32m+[0m [0magent_config {
          [32m+[0m [0m[1m[0mare_all_plugins_disabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mis_management_disabled[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mis_monitoring_disabled[0m[0m   = (known after apply)

          [32m+[0m [0mplugins_config {
              [32m+[0m [0m[1m[0mdesired_state[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mname[0m[0m          = (known after apply)
            }
        }

      [32m+[0m [0mavailability_config {
          [32m+[0m [0m[1m[0mis_live_migration_preferred[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mrecovery_action[0m[0m             = (known after apply)
        }

      [32m+[0m [0mcreate_vnic_details {
          [32m+[0m [0m[1m[0massign_public_ip[0m[0m       = "true"
          [32m+[0m [0m[1m[0mdefined_tags[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mdisplay_name[0m[0m           = "test-instance-2"
          [32m+[0m [0m[1m[0mfreeform_tags[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhostname_label[0m[0m         = "test-instance-2"
          [32m+[0m [0m[1m[0mprivate_ip[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mskip_source_dest_check[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m              = "ocid1.subnet.oc1.iad.aaaaaaaavykfd3t6zx5s7hrboxlod4byrxfczdxk3jvngm3fsuey3vzblzuq"
          [32m+[0m [0m[1m[0mvlan_id[0m[0m                = (known after apply)
        }

      [32m+[0m [0minstance_options {
          [32m+[0m [0m[1m[0mare_legacy_imds_endpoints_disabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mlaunch_options {
          [32m+[0m [0m[1m[0mboot_volume_type[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mfirmware[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0mis_consistent_volume_naming_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mis_pv_encryption_in_transit_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_type[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mremote_data_volume_type[0m[0m             = (known after apply)
        }

      [32m+[0m [0mplatform_config {
          [32m+[0m [0m[1m[0mis_measured_boot_enabled[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mis_secure_boot_enabled[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mis_trusted_platform_module_enabled[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mnuma_nodes_per_socket[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m                               = (known after apply)
        }

      [32m+[0m [0mpreemptible_instance_config {
          [32m+[0m [0mpreemption_action {
              [32m+[0m [0m[1m[0mpreserve_boot_volume[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                 = (known after apply)
            }
        }

      [32m+[0m [0mshape_config {
          [32m+[0m [0m[1m[0mbaseline_ocpu_utilization[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mgpu_description[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mgpus[0m[0m                          = (known after apply)
          [32m+[0m [0m[1m[0mlocal_disk_description[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mlocal_disks[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mlocal_disks_total_size_in_gbs[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_vnic_attachments[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmemory_in_gbs[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mnetworking_bandwidth_in_gbps[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mocpus[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mprocessor_description[0m[0m         = (known after apply)
        }

      [32m+[0m [0msource_details {
          [32m+[0m [0m[1m[0mboot_volume_size_in_gbs[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0msource_id[0m[0m               = "ocid1.image.oc1.iad.aaaaaaaadzlyimwgplwurg2nm5yiwbz4ah6hlj2aasrvq5mzcxb7reohpfka"
          [32m+[0m [0m[1m[0msource_type[0m[0m             = "image"
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mpublic_hostname[0m[0m = {
      [32m+[0m [0m1 = "test-instance-02"
        [90m# (1 unchanged element hidden)[0m[0m
    }
  [33m~[0m [0m[1m[0mpublic_ips[0m[0m      = {
      [32m+[0m [0m1 = (known after apply)
        [90m# (1 unchanged element hidden)[0m[0m
    }
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @felipe-e-ribeiro, Action: `pull_request`*